Repository: yuki-koike0626/SimplePallet
Catalog: SimplePallet/SimplePallet/Resources/Localizable.xcstrings
Source language: ja
Languages: en, ko, zh_hans, zh_hant

# action.centerThird
source: 中央1/3
en: Center 1/3
ko: 중앙 1/3
zh_hans: 居中 1/3
zh_hant: 置中 1/3

# action.left
source: 左半分
en: Left Half
ko: 왼쪽 절반
zh_hans: 左半边
zh_hant: 左半邊

# action.leftThird
source: 左1/3
en: Left 1/3
ko: 왼쪽 1/3
zh_hans: 左侧 1/3
zh_hant: 左側 1/3

# action.maximize
source: 最大化
en: Maximize
ko: 최대화

# action.right
source: 右半分
en: Right Half
ko: 오른쪽 절반
zh_hans: 右半边
zh_hant: 右半邊

# action.rightThird
source: 右1/3
en: Right 1/3
ko: 오른쪽 1/3
zh_hans: 右侧 1/3
zh_hant: 右側 1/3

# button.checkAgain
source: 再確認
en: Check Again
ko: 다시 확인
zh_hans: 重新检查
zh_hant: 重新檢查

# button.close
source: 閉じる
en: Close
ko: 닫기
zh_hans: 关闭
zh_hant: 關閉

# button.openSettings
source: 設定を開く
en: Open Settings
ko: 설정 열기
zh_hans: 打开设置
zh_hant: 開啟設定

# button.save
source: 保存する
en: Save
ko: 저장
zh_hans: 保存
zh_hant: 儲存

# howToUse.appSwitching
source: アプリ間移動を活用
en: Use App Switching
ko: 앱 전환 활용
zh_hans: 善用应用切换
zh_hant: 善用應用程式切換

# howToUse.appSwitchingDesc
source: ⌘+Tab でアプリを切り替えて効率的にウィンドウを管理
en: Switch apps with ⌘+Tab to manage windows efficiently
ko: ⌘+Tab으로 앱을 전환하여 효율적으로 윈도우 관리
zh_hans: 使用 ⌘+Tab 切换应用以高效管理窗口
zh_hant: 使用 ⌘+Tab 切換應用程式以高效管理視窗

# howToUse.cmdTabDesc
source: アプリを素早く切り替え
en: Switch apps quickly
ko: 빠르게 앱 전환
zh_hans: 快速切换应用
zh_hant: 快速切換應用程式

# howToUse.cmdTabOptionDesc
source: 最小化中のアプリ上で⌥押し、キーを離すことで解除
en: Hold ⌥ over minimized app, release keys to restore
ko: 최소화된 앱에서 ⌥ 누른 상태로 키를 떼면 복원
zh_hans: 在最小化的应用上按住 ⌥，松开按键即可恢复
zh_hant: 在最小化的應用程式上按住 ⌥，放開按鍵即可還原

# howToUse.description
source: SimplePalletとは、macOS向けのシンプルなウィンドウ管理アプリです。キーボードショートカットで最前面ウィンドウを「最大化 / 2分割 / 3分割」に瞬間的に切り替えることができます。素早いパソコン操作を行うための習慣を作ります
en: SimplePallet is a simple window management app for macOS. You can instantly switch the frontmost window to "maximize / 2-split / 3-split" with keyboard shortcuts. Build habits for fast computer operations.
ko: SimplePallet은 macOS를 위한 간단한 윈도우 관리 앱입니다. 키보드 단축키로 최전면 윈도우를 '최대화 / 2분할 / 3분할'로 즉시 전환할 수 있습니다. 빠른 컴퓨터 작업을 위한 습관을 만들어보세요
zh_hans: SimplePallet 是一款适用于 macOS 的简洁窗口管理应用。您可以通过键盘快捷键瞬间将最前面的窗口切换为「最大化 / 二分屏 / 三分屏」。培养高效电脑操作的习惯
zh_hant: SimplePallet 是一款適用於 macOS 的簡潔視窗管理應用程式。您可以透過鍵盤快速鍵瞬間將最前面的視窗切換為「最大化 / 二分割 / 三分割」。養成高效電腦操作的習慣

# howToUse.minimizeDockDesc
source: Dockに最小化（黄色ボタンと同じ）
en: Minimize to Dock (same as yellow button)
ko: Dock에 최소화 (노란색 버튼과 동일)
zh_hans: 最小化到程序坞（与黄色按钮相同）
zh_hant: 最小化到 Dock（與黃色按鈕相同）

# howToUse.recommendationsSingleDesktop
source: デスクトップは一つだけ
en: Use a single desktop
ko: 단일 데스크톱 사용
zh_hans: 使用单个桌面
zh_hant: 使用單一桌面

# howToUse.recommendationsSingleDesktopDesc
source: 複数デスクトップを使わず、一つのデスクトップで作業
en: Work on a single desktop instead of using multiple desktops
ko: 여러 데스크톱 대신 하나의 데스크톱에서 작업
zh_hans: 不使用多个桌面，在单个桌面上工作
zh_hant: 不使用多個桌面，在單一桌面上作業

# howToUse.recommendationsTitle
source: 推奨方法
en: Recommendations
ko: 권장 사항
zh_hans: 推荐方法
zh_hant: 建議方法

# howToUse.shortcutKeys
source: ショートカットキー(デフォルト)
en: Keyboard Shortcuts (Default)
ko: 키보드 단축키 (기본값)
zh_hans: 键盘快捷键（默认）
zh_hant: 鍵盤快速鍵（預設）

# howToUse.thirdSplit
source: 3分割は⌥を加えただけ(デフォルト)
en: 3-split: Just add ⌥ (Default)
ko: 3분할: ⌥만 추가 (기본값)
zh_hans: 三分屏：只需添加 ⌥（默认）
zh_hant: 三分割：只需添加 ⌥（預設）

# howToUse.title
source: Simple Pallet の使い方
en: How to Use SimplePallet
ko: SimplePallet 사용 방법
zh_hans: SimplePallet 使用方法
zh_hant: SimplePallet 使用方法

# menu.howToUse
source: 使い方を見る
en: How to Use
ko: 사용 방법 보기
zh_hans: 查看使用方法
zh_hant: 查看使用方法

# menu.quit
source: SimplePalletを終了
en: Quit SimplePallet
ko: SimplePallet 종료
zh_hans: 退出 SimplePallet
zh_hant: 結束 SimplePallet

# menu.settings
source: 設定...
en: Settings...
ko: 설정...
zh_hans: 设置...

# settings.accessibility
source: アクセシビリティ権限
en: Accessibility Permission
ko: 접근성 권한
zh_hans: 辅助功能权限
zh_hant: 輔助使用權限

# settings.accessibilityDescription
source: ウィンドウを操作するには、システム環境設定でアクセシビリティ権限を許可してください。
en: To control windows, please grant accessibility permission in System Settings.
ko: 윈도우를 제어하려면 시스템 설정에서 접근성 권한을 허용해 주세요.
zh_hans: 要控制窗口，请在系统设置中授予辅助功能权限。
zh_hant: 要控制視窗，請在系統設定中授予輔助使用權限。

# settings.customizeShortcuts
source: ショートカットをカスタマイズ
en: Customize Shortcuts
ko: 단축키 사용자 지정
zh_hans: 自定义快捷键
zh_hant: 自訂快速鍵

# settings.language
source: 言語
en: Language
ko: 언어
zh_hans: 语言
zh_hant: 語言

# settings.languageDescription
source: このアプリの表示言語を選択します。変更はすぐに反映されます。
en: Select the language for this app. Changes take effect immediately.
ko: 이 앱의 표시 언어를 선택합니다. 변경 사항은 즉시 반영됩니다.
zh_hans: 选择此应用的显示语言。更改将立即生效。
zh_hant: 選擇此應用程式的顯示語言。變更將立即生效。

# settings.launchAtLogin
source: ログイン時に自動起動
en: Launch at Login
ko: 로그인 시 자동 실행
zh_hans: 登录时自动启动
zh_hant: 登入時自動啟動

# settings.permissionGranted
source: 許可されています
en: Granted
ko: 허용됨
zh_hans: 已授权
zh_hant: 已授權

# settings.permissionRequired
source: 権限が必要です
en: Permission Required
ko: 권한 필요
zh_hans: 需要权限
zh_hant: 需要權限

# settings.saveFailed
source: 保存に失敗しました: %@
en: Failed to save: %@
ko: 저장 실패: %@
zh_hans: 保存失败：%@
zh_hant: 儲存失敗：%@

# settings.saveSuccess
source: 設定を保存しました
en: Settings saved
ko: 설정이 저장되었습니다
zh_hans: 设置已保存
zh_hant: 設定已儲存

# settings.thirdSplit
source: 3分割
en: 3-split
ko: 3분할
zh_hans: 三分屏
zh_hant: 三分割

# settings.title
source: SimplePallet 設定
en: SimplePallet Settings
ko: SimplePallet 설정
zh_hans: SimplePallet 设置

# toast.error
source: エラーが発生しました
en: An error occurred
ko: 오류가 발생했습니다
zh_hans: 发生错误
zh_hant: 發生錯誤

# toast.info
source: 情報メッセージ
en: Info message
ko: 정보 메시지
zh_hans: 信息消息
zh_hant: 資訊訊息

# window.howToUse
source: 使い方
en: How to Use
ko: 사용 방법
zh_hans: 使用方法
zh_hant: 使用方法

# window.settings
source: 設定
en: Settings
ko: 설정
zh_hans: 设置

# app.copyright
source: © 2025 SimplePallet. All rights reserved.
zh_hans: © 2025 SimplePallet. 保留所有权利。
zh_hant: © 2025 SimplePallet. 保留所有權利。
